src/toir_cf/src/Documents/торо_АнализКоренныхПричин/торо_АнализКоренныхПричин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_АнализКоренныхПричин</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.торо_КоренныеПричиныДефектов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументовАнализаПричин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КоренныеПричины</name>
    <attributes>
      <name>ТекстБлока</name>
      <type>
        <types>CatalogRef.торо_КоренныеПричиныДефектов</types>
        <types>CatalogRef.торо_ПричиныДефектов</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДБлока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДРодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗаключение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерУровня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстБлокаЯзык1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстБлокаЯзык2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректирующиеМероприятия</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДМероприятия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задание</name>
      <type>
        <types>BusinessProcessRef.Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЯзык1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЯзык2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Documents/торо_АнализКоренныхПричин/Forms/ФормаСозданияЗадач/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивСтрок") Тогда
		Для каждого Строка Из Параметры.МассивСтрок Цикл
			НоваяСтрока = ТаблицаЗаданий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
			НоваяСтрока.ПроверятьВыполнение = Ложь;
			НоваяСтрока.Флаг = Истина;
		КонецЦикла; 
	КонецЕсли;
	Если Параметры.Свойство("АнализСсылка") Тогда
		АнализСсылка = Параметры.АнализСсылка;
	КонецЕсли; 
	Если Параметры.Свойство("ОбъектРемонта") Тогда
		ОбъектРемонта = Параметры.ОбъектРемонта;
	КонецЕсли; 
	Если Параметры.Свойство("КраткоеОписание") Тогда
		КраткоеОписание = Параметры.КраткоеОписание;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	МассивЗаданий = Новый Массив();
	ПолеНеЗаполнено = Ложь;
	Для каждого Мероприятие Из ТаблицаЗаданий Цикл
		Если Мероприятие.Флаг Тогда
			Если Не ЗначениеЗаполнено(Мероприятие.Описание) ИЛИ 
				Не ЗначениеЗаполнено(Мероприятие.Ответственный) ИЛИ
				Не ЗначениеЗаполнено(Мероприятие.Важность) ИЛИ
				Не ЗначениеЗаполнено(Мероприятие.СрокВыполнения) ИЛИ 
				(Мероприятие.ПроверятьВыполнение И Не ЗначениеЗаполнено(Мероприятие.Проверяющий)) ИЛИ 
				(Мероприятие.ПроверятьВыполнение И Не ЗначениеЗаполнено(Мероприятие.СрокПроверки)) Тогда
				
				ПолеНеЗаполнено = Истина;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Если ПолеНеЗаполнено Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните обязательные поля!'"));
		Возврат;
	
	КонецЕсли;
	
	Для каждого Мероприятие Из ТаблицаЗаданий Цикл
		Если Мероприятие.Флаг Тогда
			МероприятиеСтруктура = Новый Структура("ПроверятьВыполнение, Проверяющий, Описание, Ответственный, СрокВыполнения, СрокПроверки, Важность, Задание, ИДМероприятия");
			ЗаполнитьЗначенияСвойств(МероприятиеСтруктура, Мероприятие); 
			Задание = СоздатьЗадание(МероприятиеСтруктура);
			МероприятиеСтруктура.Задание = Задание;
			МассивЗаданий.Добавить(МероприятиеСтруктура);
		КонецЕсли; 
	КонецЦикла;
	
	СтруктураОтправки = Новый Структура("МассивЗаданий", МассивЗаданий); 
	ОповеститьОВыборе(СтруктураОтправки);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СоздатьЗадание(Мероприятие)
	
	БизнесПроцесс = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	БизнесПроцесс.Автор = Пользователи.ТекущийПользователь();
	БизнесПроцесс.Дата = ТекущаяДата();
	Если ТипЗнч(Мероприятие.Ответственный) = Тип("СправочникСсылка.ВнешниеПользователи") Или
		ТипЗнч(Мероприятие.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
		БизнесПроцесс.Исполнитель = Мероприятие.Ответственный;
	Иначе
		ФизическоеЛицо = Мероприятие.Ответственный.ФизическоеЛицо;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо";
		
		Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			БизнесПроцесс.Исполнитель = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(БизнесПроцесс.Исполнитель) Тогда
		Возврат БизнесПроцессы.Задание.ПустаяСсылка();
	КонецЕсли;
	
	БизнесПроцесс.Наименование = СтрШаблон(НСтр("ru = 'Корректирующее мероприятие по дефекту ""%1"" оборудования ""%2""'"), КраткоеОписание, ОбъектРемонта);
	БизнесПроцесс.Содержание = Мероприятие.Описание;
	Если Мероприятие.ПроверятьВыполнение Тогда
		БизнесПроцесс.НаПроверке = Мероприятие.ПроверятьВыполнение;
		БизнесПроцесс.Проверяющий = Мероприятие.Проверяющий;
		БизнесПроцесс.СрокПроверки = Мероприятие.СрокПроверки;
	КонецЕсли; 
	БизнесПроцесс.Предмет = АнализСсылка;
	БизнесПроцесс.Важность = Мероприятие.Важность;
	БизнесПроцесс.СрокИсполнения = Мероприятие.СрокВыполнения;
	
	БизнесПроцесс.Записать();
	БизнесПроцесс.Старт();	
	Возврат БизнесПроцесс.Ссылка;
КонецФункции

&НаКлиенте
Процедура СнятьВыделение(Команда)
	Для каждого Строка Из ТаблицаЗаданий Цикл
		Строка.Флаг = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для каждого Строка Из ТаблицаЗаданий Цикл
		Строка.Флаг = Истина;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти
